#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Personal-Projects-cpwill/DE_Zoomcamp_Project/runs/run-qNrUWbauVCqwP995

Waiting for the plan to start...

Terraform v1.11.2
on linux_amd64
Initializing plugins and modules...
google_bigquery_dataset.web_events_dataset: Refreshing state... [id=projects/decamp-450109/datasets/web_events_dataset]
google_storage_bucket.web_events_bucket: Refreshing state... [id=web-events-bucket]
google_storage_bucket.web_events_bucket: Drift detected (update)
google_bigquery_dataset.web_events_dataset: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.eventsim_kafka_instance will be created
  + resource "google_compute_instance" "eventsim_kafka_instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + creation_timestamp        = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + effective_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-standard-4"
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "eventsim-kafka-instance"
      + project                   = "decamp-450109"
      + self_link                 = (known after apply)
      + tags                      = [
          + "eventsim",
          + "kafka",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                      = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "ubuntu-os-cloud/ubuntu-2204-lts"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 25
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config (known after apply)

      + guest_accelerator (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity (known after apply)

      + scheduling (known after apply)

      + service_account {
          + email  = "evensim-kafka@decamp-450109.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/devstorage.read_write",
            ]
        }
    }

  # google_project_iam_member.eventsim_kafka_role will be created
  + resource "google_project_iam_member" "eventsim_kafka_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:evensim-kafka@decamp-450109.iam.gserviceaccount.com"
      + project = "decamp-450109"
      + role    = "roles/storage.objectUser"
    }

  # google_service_account.eventsim_kafka_sa will be created
  + resource "google_service_account" "eventsim_kafka_sa" {
      + account_id   = "evensim-kafka"
      + disabled     = false
      + display_name = "Service Account for eventsim kafka compute instance"
      + email        = "evensim-kafka@decamp-450109.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:evensim-kafka@decamp-450109.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "decamp-450109"
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @cpwill01, Action: `pull_request`*